nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/UI/Displays/OTM8009A/OTM8009A_driver.cpp
#include "nanohal.h"
#include "nanoCLR_Types.h"
#include "OTM8009A.h"
#include "hal.h"
#include "nanohal.h"
#include "stm32f769xx.h"
#include "stm32f769i_discovery_lcd.h"


OTM8009A_Driver g_OTM8009A_Driver;

void DSI_IO_WriteCmd(uint32_t NbrParams, uint8_t *pParams)
{
    if (NbrParams <= 1)
    {
        HAL_DSI_ShortWrite(&hdsi_discovery, LCD_OTM8009A_ID, DSI_DCS_SHORT_PKT_WRITE_P1, pParams[0], pParams[1]);
    }
    else
    {
        HAL_DSI_LongWrite(&hdsi_discovery, LCD_OTM8009A_ID, DSI_DCS_LONG_PKT_WRITE, NbrParams, pParams[NbrParams], pParams);
    }
}
bool OTM8009A_Driver::SetWindow(CLR_UINT16 x1, CLR_UINT16 y1, CLR_UINT16 x2, CLR_UINT16 y2)
{
    CLR_UINT16 x1_x2;
    CLR_UINT16 Addr1, Addr2;

    switch (g_OTM8009A_Driver.lcd_orientation)
    {
    default:
        // Invalid! Fall through to portrait mode
    case PORTRAIT:
        Addr1 = x1;
        Addr2 = y1;
        x1_x2 = (CLR_UINT16)((x2 << 8) + x1);   // pack X-Values into one word            
        break;
    case PORTRAIT180:
        Addr1 = (CLR_UINT16)(SCREEN_SIZE_SHORTER_SIDE - 1 - x1);
        Addr2 = (CLR_UINT16)(SCREEN_SIZE_LONGER_SIDE - 1 - y1);
        x1_x2 = (CLR_UINT16)((Addr1 << 8) + (SCREEN_SIZE_SHORTER_SIDE - 1 - x2));    // pack X-Values into one word
        y1 = (CLR_UINT16)(SCREEN_SIZE_LONGER_SIDE - 1 - y2);
        y2 = Addr2;
        break;
    case LANDSCAPE:
        Addr1 = (CLR_UINT16)(SCREEN_SIZE_SHORTER_SIDE - 1 - y1);
        Addr2 = x1;
        x1_x2 = (CLR_UINT16)((Addr1 << 8) + (SCREEN_SIZE_SHORTER_SIDE - 1 - y2));    // pack X-Values into one word
        y1 = x1;
        y2 = x2;
        break;
    case LANDSCAPE180:
        Addr1 = y1;
        Addr2 = (CLR_UINT16)(SCREEN_SIZE_LONGER_SIDE - 1 - x1);    // pack X-Values into one word
        x1_x2 = (CLR_UINT16)((y2 << 8) + y1);
        y1 = (CLR_UINT16)(SCREEN_SIZE_LONGER_SIDE - 1 - x2);
        y2 = Addr2;
        break;
    }

    // SET Windows colstart,rowstart,

    return TRUE;
}
bool OTM8009A_Driver::Initialize()
{
    g_OTM8009A_Driver.m_cursor = 0;

    BSP_LCD_Init();
    BSP_LCD_LayerDefaultInit(0, LCD_FB_START_ADDRESS);

    osDelay(50);
    Clear();
    return TRUE;
}
bool OTM8009A_Driver::Uninitialize()
{
    Clear();
    return TRUE;
}
void OTM8009A_Driver::PowerSave(bool On)
{
    return;
}
void OTM8009A_Driver::Clear()
{
    // Clear OTM8009A display

    // example::    SetWindow(0, 0, LCD_HW_WIDTH - 1, LCD_HW_HEIGHT - 1);
    //reset the cursor pos to the begining
    g_OTM8009A_Driver.m_cursor = 0;
}
void OTM8009A_Driver::BitBltEx(int x, int y, int width, int height, CLR_UINT32 data[])
{
    ASSERT((x >= 0) && ((x + width) <= LCD_SCREEN_WIDTH));
    ASSERT((y >= 0) && ((y + height) <= LCD_SCREEN_HEIGHT));

    CLR_UINT16 * StartOfLine_src = (CLR_UINT16*)&data[0];
    SetWindow(x, y, (x + width - 1), (y + height - 1));

    CLR_UINT16 offset = (y * g_OTM8009A_Config.Width) + x;
    StartOfLine_src += offset;

    while (height--)
    {
        CLR_UINT16 * src;
        int      Xcnt;
        src = StartOfLine_src;
        Xcnt = width;
        while (Xcnt--)
        {
            // SendDataWord(*src++);

        }
        StartOfLine_src += g_OTM8009A_Config.Width;
    }
}
void OTM8009A_Driver::BitBlt(int width, int height, int widthInWords, CLR_UINT32 data[], bool fUseDelta)
{
    _ASSERTE(width == (int)LCD_GetWidth());
    _ASSERTE(height == (int)LCD_GetHeight());
    _ASSERTE(widthInWords == width / (int)PixelsPerWord());

    BitBltEx(0, 0, width, height, data);
}
void OTM8009A_Driver::WriteChar(unsigned char c, int row, int col)
{
    // MUNEEB - Font_Width refers to font 8x8 or 8x15...so limiting it to 8x8.  tinyclr.proj defines that we are using 8x8
    //int width = Font_Width();
    //int height = Font_Height();
    int width = 8;
    int height = 8;

    // convert to LCD pixel coordinates
    row *= height;
    col *= width;

    if (row > (g_OTM8009A_Config.Height - height)) return;
    if (col > (g_OTM8009A_Config.Width - width)) return;

    const CLR_UINT8* font = Font_GetGlyph(c);
    // MUNEEB - SEE NOTE ABOVE
    //CLR_UINT16 data[height*width];
    CLR_UINT16 data[8 * 8];
    int i = 0;
    for (int y = 0; y < height; y++)
    {
        for (int x = 0; x < width; x++)
        {
            CLR_UINT16 val = LCD_COLOR_BKG;
            // the font data is mirrored
            if ((font[y] & (1 << (width - x - 1))) != 0) val |= LCD_COLOR_TEXT;
            data[i] = val;
            i++;
        }
    }
    SetWindow(col, row, col + width - 1, row + height - 1);
    for (i = 0; i < width*height; i++)
    {
        //////// SendDataWord(data[i]);
    }
}
void OTM8009A_Driver::WriteFormattedChar(unsigned char c)
{
    if (c < 32)
    {
        switch (c)
        {
        case '\b':                      /* backspace, clear previous char and move cursor back */
            if ((g_OTM8009A_Driver.m_cursor % TextColumns()) > 0)
            {
                g_OTM8009A_Driver.m_cursor--;
                WriteChar(' ', g_OTM8009A_Driver.m_cursor / TextColumns(), g_OTM8009A_Driver.m_cursor % TextColumns());
            }
            break;

        case '\f':                      /* formfeed, clear screen and home cursor */
            //Clear();
            g_OTM8009A_Driver.m_cursor = 0;
            break;

        case '\n':                      /* newline */
            g_OTM8009A_Driver.m_cursor += TextColumns();
            g_OTM8009A_Driver.m_cursor -= (g_OTM8009A_Driver.m_cursor % TextColumns());
            break;

        case '\r':                      /* carriage return */
            g_OTM8009A_Driver.m_cursor -= (g_OTM8009A_Driver.m_cursor % TextColumns());
            break;

        case '\t':                      /* horizontal tab */
            g_OTM8009A_Driver.m_cursor += (Font_TabWidth() - ((g_OTM8009A_Driver.m_cursor % TextColumns()) % Font_TabWidth()));
            // deal with line wrap scenario
            if ((g_OTM8009A_Driver.m_cursor % TextColumns()) < Font_TabWidth())
            {
                // bring the cursor to start of line
                g_OTM8009A_Driver.m_cursor -= (g_OTM8009A_Driver.m_cursor % TextColumns());
            }
            break;

