nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/UI/Displays/OTM8009A/OTM8009A_driver.cpp
        case '\v':                      /* vertical tab */
            g_OTM8009A_Driver.m_cursor += TextColumns();
            break;

        default:
            DEBUG_TRACE2(TRACE_ALWAYS, "Unrecognized control character in LCD_WriteChar: %2u (0x%02x)\r\n", (unsigned int)c, (unsigned int)c);
            break;
        }
    }
    else
    {
        WriteChar(c, g_OTM8009A_Driver.m_cursor / TextColumns(), g_OTM8009A_Driver.m_cursor % TextColumns());
        g_OTM8009A_Driver.m_cursor++;
    }

    if (g_OTM8009A_Driver.m_cursor >= (TextColumns() * TextRows()))
    {
        g_OTM8009A_Driver.m_cursor = 0;
    }
} //done
CLR_UINT32 OTM8009A_Driver::PixelsPerWord()
{
    return ((8 * sizeof(CLR_UINT32)) / g_OTM8009A_Config.BitsPerPixel);
} //done
CLR_UINT32 OTM8009A_Driver::TextRows()
{
    return (g_OTM8009A_Config.Height / Font_Height());
} //done
CLR_UINT32 OTM8009A_Driver::TextColumns()
{
    return (g_OTM8009A_Config.Width / Font_Width());
} //done
CLR_UINT32 OTM8009A_Driver::WidthInWords()
{
    return ((g_OTM8009A_Config.Width + (PixelsPerWord() - 1)) / PixelsPerWord());
} //done
CLR_UINT32 OTM8009A_Driver::SizeInWords()
{
    return (WidthInWords() * g_OTM8009A_Config.Height);
} //done
CLR_UINT32 OTM8009A_Driver::SizeInBytes()
{
    return (SizeInWords() * sizeof(CLR_UINT32));
} //done

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunknown-pragmas"
#pragma region Code copied from MBED - NOT CHECKED

    /**
      * @brief  BSP LCD Reset
      *         Hw reset the LCD DSI activating its XRES signal (active low for some time)
      *         and desactivating it later.
      */


    void BSP_LCD_Reset(void)
    {
        GPIO_InitTypeDef  gpio_init_structure;

        __HAL_RCC_GPIOJ_CLK_ENABLE();

        /* Configure the GPIO on PJ15 */
        gpio_init_structure.Pin = GPIO_PIN_15;
        gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
        gpio_init_structure.Pull = GPIO_PULLUP;
        gpio_init_structure.Speed = GPIO_SPEED_HIGH;

        HAL_GPIO_Init(GPIOJ, &gpio_init_structure);

        /* Activate XRES active low */
        HAL_GPIO_WritePin(GPIOJ, GPIO_PIN_15, GPIO_PIN_RESET);

        wait_ms(20); /* wait 20 ms */

        /* Desactivate XRES */
        HAL_GPIO_WritePin(GPIOJ, GPIO_PIN_15, GPIO_PIN_SET);

        /* Wait for 10ms after releasing XRES before sending commands */
        wait_ms(10);
    }

    #define LCD_DSI_ID              0x11
    #define LCD_DSI_ADDRESS         TS_I2C_ADDRESS
    #define LCD_DSI_ID_REG          0xA8

    static DSI_VidCfgTypeDef hdsivideo_handle;
    #define ABS(X)                 ((X) > 0 ? (X) : -(X))
    #define POLY_X(Z)              ((int32_t)((Points + (Z))->X))
    #define POLY_Y(Z)              ((int32_t)((Points + (Z))->Y))


    DMA2D_HandleTypeDef hdma2d_discovery;
    LTDC_HandleTypeDef  hltdc_discovery;
    DSI_HandleTypeDef hdsi_discovery;
    uint32_t lcd_x_size = OTM8009A_800X480_WIDTH;
    uint32_t lcd_y_size = OTM8009A_800X480_HEIGHT;

    static uint32_t  ActiveLayer = LTDC_ACTIVE_LAYER_BACKGROUND;  //Default Active LTDC Layer in which drawing is made is LTDC Layer Background
    static LCD_DrawPropTypeDef DrawProp[LTDC_MAX_LAYER_NUMBER];  // Current Drawing Layer properties variable
    static void LL_ConvertLineToARGB8888(void * pSrc, void *pDst, uint32_t xSize, uint32_t ColorMode);
    static uint16_t LCD_IO_GetID(void);

    //  Initializes the DSI LCD.
    //       - DSI PLL ititialization
    //       - DSI ititialization
    //       - LTDC ititialization
    //       - OTM8009A LCD Display IC Driver ititialization
    //  orientation: LCD orientation, can be LCD_ORIENTATION_PORTRAIT or LCD_ORIENTATION_LANDSCAPE
    uint8_t BSP_LCD_InitEx(LCD_OrientationTypeDef orientation)
    {
        DSI_PLLInitTypeDef dsiPllInit;
        static RCC_PeriphCLKInitTypeDef  PeriphClkInitStruct;
        uint32_t LcdClock = 27429; /*!< LcdClk = 27429 kHz */
        uint16_t read_id = 0;

        uint32_t laneByteClk_kHz = 0;
        uint32_t                   VSA; /*!< Vertical start active time in units of lines */
        uint32_t                   VBP; /*!< Vertical Back Porch time in units of lines */
        uint32_t                   VFP; /*!< Vertical Front Porch time in units of lines */
        uint32_t                   VACT; /*!< Vertical Active time in units of lines = imageSize Y in pixels to display */
        uint32_t                   HSA; /*!< Horizontal start active time in units of lcdClk */
        uint32_t                   HBP; /*!< Horizontal Back Porch time in units of lcdClk */
        uint32_t                   HFP; /*!< Horizontal Front Porch time in units of lcdClk */
        uint32_t                   HACT; /*!< Horizontal Active time in units of lcdClk = imageSize X in pixels to display */

    // Toggle Hardware Reset of the DSI LCD using its XRES signal (active low)
        BSP_LCD_Reset();

        // Call first MSP Initialize only in case of first initialization
        // This will set IP blocks LTDC, DSI and DMA2D
        //      - out of reset
        //      - clocked
        //      - NVIC IRQ related to IP blocks enabled
        // 
        BSP_LCD_MspInit();

        // DSI Initialization
        hdsi_discovery.Instance = DSI;          // Base address of DSI Host/Wrapper registers to be set before calling De-Init
        HAL_DSI_DeInit(&(hdsi_discovery));
        dsiPllInit.PLLNDIV = 100;
        dsiPllInit.PLLIDF = DSI_PLL_IN_DIV5;
        dsiPllInit.PLLODF = DSI_PLL_OUT_DIV1;
        laneByteClk_kHz = 62500;                // 500 MHz / 8 = 62.5 MHz = 62500 kHz
        hdsi_discovery.Init.NumberOfLanes = DSI_TWO_DATA_LANES;     // Set number of Lanes
        hdsi_discovery.Init.TXEscapeCkdiv = laneByteClk_kHz / 15620;        // TXEscapeCkdiv = f(LaneByteClk)/15.62 = 4
        HAL_DSI_Init(&(hdsi_discovery), &(dsiPllInit));
        // Timing parameters for all Video modes, Set Timing parameters of LTDC depending on its chosen orientation

        if (orientation == LCD_ORIENTATION_PORTRAIT)
        {
            lcd_x_size = OTM8009A_480X800_WIDTH;  /* 480 */
            lcd_y_size = OTM8009A_480X800_HEIGHT; /* 800 */
        }
        else
        {
            /* lcd_orientation == LCD_ORIENTATION_LANDSCAPE */
            lcd_x_size = OTM8009A_800X480_WIDTH;  /* 800 */
            lcd_y_size = OTM8009A_800X480_HEIGHT; /* 480 */
        }

