nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/UI/Displays/OTM8009A/OTM8009A_driver.cpp
        /***********************OTM8009A Initialization********************************/

          /* Initialize the OTM8009A LCD Display IC Driver (KoD LCD IC Driver)
          *  depending on configuration set in 'hdsivideo_handle'.
          */
        OTM8009A_Init(OTM8009A_FORMAT_RGB888, orientation);

        /***********************End OTM8009A Initialization****************************/

        return LCD_OK;
    }

    #if defined(USE_LCD_HDMI)
    /**
      * @brief  Initializes the DSI for HDMI monitor.
      * The ititialization is done as below:
      *     - DSI PLL ititialization
      *     - DSI ititialization
      *     - LTDC ititialization
      *     - DSI-HDMI ADV7533 adapter device ititialization
      * @param  format : HDMI format could be HDMI_FORMAT_720_480 or HDMI_FORMAT_720_576
      * @retval LCD state
      */
    uint8_t BSP_LCD_HDMIInitEx(uint8_t format)
    {
        /************************ADV7533 Initialization********************************/

        /* Initialize the ADV7533 HDMI Bridge
        *  depending on configuration set in 'hdsivideo_handle'.
        */
        adv7533ConfigTypeDef adv7533_config;

        adv7533_config.DSI_LANES = 2;
        adv7533_config.HACT = HDMI_Format[format].HACT;
        adv7533_config.HSYNC = HDMI_Format[format].HSYNC;
        adv7533_config.HBP = HDMI_Format[format].HBP;
        adv7533_config.HFP = HDMI_Format[format].HFP;
        adv7533_config.VACT = HDMI_Format[format].VACT;
        adv7533_config.VSYNC = HDMI_Format[format].VSYNC;
        adv7533_config.VBP = HDMI_Format[format].VBP;
        adv7533_config.VFP = HDMI_Format[format].VFP;

        ADV7533_Init();
        ADV7533_Configure(&adv7533_config);
        ADV7533_PowerOn();

        /************************ Update hdmi_x_size and hdmi_y_size *****************/
        lcd_x_size = HDMI_Format[format].HACT;
        lcd_y_size = HDMI_Format[format].VACT;

        /***********************End ADV7533 Initialization****************************/
        DSI_PLLInitTypeDef dsiPllInit;
        DSI_PHY_TimerTypeDef dsiPhyInit;
        static RCC_PeriphCLKInitTypeDef  PeriphClkInitStruct;

        /* Call first MSP Initialize only in case of first initialization
        * This will set IP blocks LTDC and DSI
        * - out of reset
        * - clocked
        * - NVIC IRQ related to IP blocks enabled
        */
        BSP_LCD_MspInit();

        /*************************DSI Initialization***********************************/

          /* Base address of DSI Host/Wrapper registers to be set before calling De-Init */
        hdsi_discovery.Instance = DSI;

        HAL_DSI_DeInit(&(hdsi_discovery));

        /* Configure the DSI PLL */
        dsiPllInit.PLLNDIV = HDMI_PLLConfig[format].NDIV;
        dsiPllInit.PLLIDF = HDMI_PLLConfig[format].IDF;
        dsiPllInit.PLLODF = HDMI_PLLConfig[format].ODF;

        /* Set number of Lanes */
        hdsi_discovery.Init.NumberOfLanes = DSI_TWO_DATA_LANES;
        /* Set the TX escape clock division ratio */
        hdsi_discovery.Init.TXEscapeCkdiv = HDMI_PLLConfig[format].TXEscapeCkdiv;
        /* Disable the automatic clock lane control (the ADV7533 must be clocked) */
        hdsi_discovery.Init.AutomaticClockLaneControl = DSI_AUTO_CLK_LANE_CTRL_DISABLE;

        /* Init the DSI */
        HAL_DSI_Init(&hdsi_discovery, &dsiPllInit);

        /* Configure the D-PHY Timings */
        dsiPhyInit.ClockLaneHS2LPTime = 0x14;
        dsiPhyInit.ClockLaneLP2HSTime = 0x14;
        dsiPhyInit.DataLaneHS2LPTime = 0x0A;
        dsiPhyInit.DataLaneLP2HSTime = 0x0A;
        dsiPhyInit.DataLaneMaxReadTime = 0x00;
        dsiPhyInit.StopWaitTime = 0x0;
        HAL_DSI_ConfigPhyTimer(&hdsi_discovery, &dsiPhyInit);

        /* Virutal channel used by the ADV7533 */
        hdsivideo_handle.VirtualChannelID = HDMI_ADV7533_ID;

        /* Timing parameters for Video modes
           Set Timing parameters of DSI depending on its chosen format */
        hdsivideo_handle.ColorCoding = HDMI_Format[format].RGB_CODING;
        hdsivideo_handle.LooselyPacked = DSI_LOOSELY_PACKED_DISABLE;
        hdsivideo_handle.VSPolarity = DSI_VSYNC_ACTIVE_LOW;
        hdsivideo_handle.HSPolarity = DSI_HSYNC_ACTIVE_LOW;
        hdsivideo_handle.DEPolarity = DSI_DATA_ENABLE_ACTIVE_HIGH;
        hdsivideo_handle.Mode = DSI_VID_MODE_NB_PULSES;
        hdsivideo_handle.NullPacketSize = HDMI_DSIPacket[format].NullPacketSize;
        hdsivideo_handle.NumberOfChunks = HDMI_DSIPacket[format].NumberOfChunks;
        hdsivideo_handle.PacketSize = HDMI_DSIPacket[format].PacketSize;
        hdsivideo_handle.HorizontalSyncActive = HDMI_Format[format].HSYNC*HDMI_PLLConfig[format].LaneByteClock / HDMI_PLLConfig[format].PCLK;
        hdsivideo_handle.HorizontalBackPorch = HDMI_Format[format].HBP*HDMI_PLLConfig[format].LaneByteClock / HDMI_PLLConfig[format].PCLK;
        hdsivideo_handle.HorizontalLine = (HDMI_Format[format].HACT + HDMI_Format[format].HSYNC + HDMI_Format[format].HBP + HDMI_Format[format].HFP)*HDMI_PLLConfig[format].LaneByteClock / HDMI_PLLConfig[format].PCLK;
        hdsivideo_handle.VerticalSyncActive = HDMI_Format[format].VSYNC;
        hdsivideo_handle.VerticalBackPorch = HDMI_Format[format].VBP;
        hdsivideo_handle.VerticalFrontPorch = HDMI_Format[format].VFP;
        hdsivideo_handle.VerticalActive = HDMI_Format[format].VACT;

        /* Enable or disable sending LP command while streaming is active in video mode */
        hdsivideo_handle.LPCommandEnable = DSI_LP_COMMAND_DISABLE; /* Enable sending commands in mode LP (Low Power) */

        /* Largest packet size possible to transmit in LP mode in VSA, VBP, VFP regions */
        /* Only useful when sending LP packets is allowed while streaming is active in video mode */
        hdsivideo_handle.LPLargestPacketSize = 4;

        /* Largest packet size possible to transmit in LP mode in HFP region during VACT period */
        /* Only useful when sending LP packets is allowed while streaming is active in video mode */
        hdsivideo_handle.LPVACTLargestPacketSize = 4;

        /* Specify for each region, if the going in LP mode is allowed */
        /* while streaming is active in video mode                     */
        hdsivideo_handle.LPHorizontalFrontPorchEnable = DSI_LP_HFP_DISABLE;
        hdsivideo_handle.LPHorizontalBackPorchEnable = DSI_LP_HBP_DISABLE;
        hdsivideo_handle.LPVerticalActiveEnable = DSI_LP_VACT_DISABLE;
        hdsivideo_handle.LPVerticalFrontPorchEnable = DSI_LP_VFP_DISABLE;
        hdsivideo_handle.LPVerticalBackPorchEnable = DSI_LP_VBP_DISABLE;
        hdsivideo_handle.LPVerticalSyncActiveEnable = DSI_LP_VSYNC_DISABLE;

