nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/UI/Displays/OTM8009A/OTM8009A_driver.cpp
        /* No acknoledge at the end of a frame */
        hdsivideo_handle.FrameBTAAcknowledgeEnable = DSI_FBTAA_DISABLE;

        /* Configure DSI Video mode timings with settings set above */
        HAL_DSI_ConfigVideoMode(&hdsi_discovery, &hdsivideo_handle);

        /* Enable the DSI host and wrapper : but LTDC is not started yet at this stage */
        HAL_DSI_Start(&hdsi_discovery);

        /*************************End DSI Initialization*******************************/


        /************************LTDC Initialization***********************************/

          /* LTDC clock configuration */
        PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_LTDC;
        PeriphClkInitStruct.PLLSAI.PLLSAIN = HDMI_PLLConfig[format].PLLSAIN;
        PeriphClkInitStruct.PLLSAI.PLLSAIR = HDMI_PLLConfig[format].PLLSAIR;
        PeriphClkInitStruct.PLLSAIDivR = RCC_PLLSAIDIVR_2;
        HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct);

        /* Base address of LTDC registers to be set before calling De-Init */
        hltdc_discovery.Instance = LTDC;

        HAL_LTDC_DeInit(&(hltdc_discovery));

        /* Timing Configuration */
        hltdc_discovery.Init.HorizontalSync = (HDMI_Format[format].HSYNC - 1);
        hltdc_discovery.Init.AccumulatedHBP = (HDMI_Format[format].HSYNC + HDMI_Format[format].HBP - 1);
        hltdc_discovery.Init.AccumulatedActiveW = (HDMI_Format[format].HACT + HDMI_Format[format].HSYNC + HDMI_Format[format].HBP - 1);
        hltdc_discovery.Init.TotalWidth = (HDMI_Format[format].HACT + HDMI_Format[format].HSYNC + HDMI_Format[format].HBP + HDMI_Format[format].HFP - 1);
        hltdc_discovery.Init.VerticalSync = (HDMI_Format[format].VSYNC - 1);
        hltdc_discovery.Init.AccumulatedVBP = (HDMI_Format[format].VSYNC + HDMI_Format[format].VBP - 1);
        hltdc_discovery.Init.AccumulatedActiveH = (HDMI_Format[format].VACT + HDMI_Format[format].VSYNC + HDMI_Format[format].VBP - 1);
        hltdc_discovery.Init.TotalHeigh = (HDMI_Format[format].VACT + HDMI_Format[format].VSYNC + HDMI_Format[format].VBP + HDMI_Format[format].VFP - 1);

        /* background value */
        hltdc_discovery.Init.Backcolor.Blue = 0x00;
        hltdc_discovery.Init.Backcolor.Green = 0xFF;
        hltdc_discovery.Init.Backcolor.Red = 0xFF;

        /* Polarity */
        hltdc_discovery.Init.HSPolarity = LTDC_HSPOLARITY_AL;
        hltdc_discovery.Init.VSPolarity = LTDC_VSPOLARITY_AL;
        hltdc_discovery.Init.DEPolarity = LTDC_DEPOLARITY_AL;
        hltdc_discovery.Init.PCPolarity = LTDC_PCPOLARITY_IPC;

        /* Initialize & Start the LTDC */
        HAL_LTDC_Init(&hltdc_discovery);

    #if !defined(DATA_IN_ExtSDRAM)
        /* Initialize the SDRAM */
        BSP_SDRAM_Init();
    #endif /* DATA_IN_ExtSDRAM */

        /* Initialize the font */
        BSP_LCD_SetFont(&LCD_DEFAULT_FONT);
        /************************End LTDC Initialization*******************************/

        return LCD_OK;
    }
    #endif /* USE_LCD_HDMI */


    /**
      * @brief  Gets the LCD X size.
      * @retval Used LCD X size
      */
    uint32_t BSP_LCD_GetXSize(void)
    {
        return (lcd_x_size);
    }

    /**
      * @brief  Gets the LCD Y size.
      * @retval Used LCD Y size
      */
    uint32_t BSP_LCD_GetYSize(void)
    {
        return (lcd_y_size);
    }

    /**
      * @brief  Set the LCD X size.
      * @param  imageWidthPixels : uint32_t image width in pixels unit
      * @retval None
      */
    void BSP_LCD_SetXSize(uint32_t imageWidthPixels)
    {
        hltdc_discovery.LayerCfg[ActiveLayer].ImageWidth = imageWidthPixels;
    }

    /**
      * @brief  Set the LCD Y size.
      * @param  imageHeightPixels : uint32_t image height in lines unit
      */
    void BSP_LCD_SetYSize(uint32_t imageHeightPixels)
    {
        hltdc_discovery.LayerCfg[ActiveLayer].ImageHeight = imageHeightPixels;
    }


    /**
      * @brief  Initializes the LCD layers.
      * @param  LayerIndex: Layer foreground or background
      * @param  FB_Address: Layer frame buffer
      * @retval None
      */
    void BSP_LCD_LayerDefaultInit(uint16_t LayerIndex, uint32_t FB_Address)
    {
        LCD_LayerCfgTypeDef  Layercfg;

        /* Layer Init */
        Layercfg.WindowX0 = 0;
        Layercfg.WindowX1 = BSP_LCD_GetXSize();
        Layercfg.WindowY0 = 0;
        Layercfg.WindowY1 = BSP_LCD_GetYSize();
        Layercfg.PixelFormat = LTDC_PIXEL_FORMAT_ARGB8888;
        Layercfg.FBStartAdress = FB_Address;
        Layercfg.Alpha = 255;
        Layercfg.Alpha0 = 0;
        Layercfg.Backcolor.Blue = 0;
        Layercfg.Backcolor.Green = 0;
        Layercfg.Backcolor.Red = 0;
        Layercfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
        Layercfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;
        Layercfg.ImageWidth = BSP_LCD_GetXSize();
        Layercfg.ImageHeight = BSP_LCD_GetYSize();

        HAL_LTDC_ConfigLayer(&hltdc_discovery, &Layercfg, LayerIndex);

        DrawProp[LayerIndex].BackColor = LCD_COLOR_WHITE;
        DrawProp[LayerIndex].pFont = &Font24;
        DrawProp[LayerIndex].TextColor = LCD_COLOR_BLACK;
    }


    /**
      * @brief  Selects the LCD Layer.
      * @param  LayerIndex: Layer foreground or background
      */
    void BSP_LCD_SelectLayer(uint32_t LayerIndex)
    {
        ActiveLayer = LayerIndex;
    }

    /**
      * @brief  Sets an LCD Layer visible
      * @param  LayerIndex: Visible Layer
      * @param  State: New state of the specified layer
      *          This parameter can be one of the following values:
      *            @arg  ENABLE
      *            @arg  DISABLE
      */
    void BSP_LCD_SetLayerVisible(uint32_t LayerIndex, FunctionalState State)
    {
        if (State == ENABLE)
        {
            __HAL_LTDC_LAYER_ENABLE(&(hltdc_discovery), LayerIndex);
        }
        else
        {
            __HAL_LTDC_LAYER_DISABLE(&(hltdc_discovery), LayerIndex);
        }
        __HAL_LTDC_RELOAD_CONFIG(&(hltdc_discovery));

