nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/UI/Displays/OTM8009A/OTM8009A_driver.cpp
    }

    /**
      * @brief  Configures the transparency.
      * @param  LayerIndex: Layer foreground or background.
      * @param  Transparency: Transparency
      *           This parameter must be a number between Min_Data = 0x00 and Max_Data = 0xFF
      */
    void BSP_LCD_SetTransparency(uint32_t LayerIndex, uint8_t Transparency)
    {

        HAL_LTDC_SetAlpha(&(hltdc_discovery), Transparency, LayerIndex);

    }

    /**
      * @brief  Sets an LCD layer frame buffer address.
      * @param  LayerIndex: Layer foreground or background
      * @param  Address: New LCD frame buffer value
      */
    void BSP_LCD_SetLayerAddress(uint32_t LayerIndex, uint32_t Address)
    {

        HAL_LTDC_SetAddress(&(hltdc_discovery), Address, LayerIndex);

    }

    /**
      * @brief  Sets display window.
      * @param  LayerIndex: Layer index
      * @param  Xpos: LCD X position
      * @param  Ypos: LCD Y position
      * @param  Width: LCD window width
      * @param  Height: LCD window height
      */
    void BSP_LCD_SetLayerWindow(uint16_t LayerIndex, uint16_t Xpos, uint16_t Ypos, uint16_t Width, uint16_t Height)
    {
        /* Reconfigure the layer size */
        HAL_LTDC_SetWindowSize(&(hltdc_discovery), Width, Height, LayerIndex);

        /* Reconfigure the layer position */
        HAL_LTDC_SetWindowPosition(&(hltdc_discovery), Xpos, Ypos, LayerIndex);

    }

    /**
      * @brief  Configures and sets the color keying.
      * @param  LayerIndex: Layer foreground or background
      * @param  RGBValue: Color reference
      */
    void BSP_LCD_SetColorKeying(uint32_t LayerIndex, uint32_t RGBValue)
    {
        /* Configure and Enable the color Keying for LCD Layer */
        HAL_LTDC_ConfigColorKeying(&(hltdc_discovery), RGBValue, LayerIndex);
        HAL_LTDC_EnableColorKeying(&(hltdc_discovery), LayerIndex);
    }

    /**
      * @brief  Disables the color keying.
      * @param  LayerIndex: Layer foreground or background
      */
    void BSP_LCD_ResetColorKeying(uint32_t LayerIndex)
    {
        /* Disable the color Keying for LCD Layer */
        HAL_LTDC_DisableColorKeying(&(hltdc_discovery), LayerIndex);
    }

    /**
      * @brief  Sets the LCD text color.
      * @param  Color: Text color code ARGB(8-8-8-8)
      */
    void BSP_LCD_SetTextColor(uint32_t Color)
    {
        DrawProp[ActiveLayer].TextColor = Color;
    }

    /**
      * @brief  Gets the LCD text color.
      * @retval Used text color.
      */
    uint32_t BSP_LCD_GetTextColor(void)
    {
        return DrawProp[ActiveLayer].TextColor;
    }

    /**
      * @brief  Sets the LCD background color.
      * @param  Color: Layer background color code ARGB(8-8-8-8)
      */
    void BSP_LCD_SetBackColor(uint32_t Color)
    {
        DrawProp[ActiveLayer].BackColor = Color;
    }

    /**
      * @brief  Gets the LCD background color.
      * @retval Used background color
      */
    uint32_t BSP_LCD_GetBackColor(void)
    {
        return DrawProp[ActiveLayer].BackColor;
    }

    /**
      * @brief  Sets the LCD text font.
      * @param  fonts: Layer font to be used
      */
    void BSP_LCD_SetFont(sFONT *fonts)
    {
        DrawProp[ActiveLayer].pFont = fonts;
    }

    /**
      * @brief  Gets the LCD text font.
      * @retval Used layer font
      */
    sFONT *BSP_LCD_GetFont(void)
    {
        return DrawProp[ActiveLayer].pFont;
    }

    /**
      * @brief  Reads an LCD pixel.
      * @param  Xpos: X position
      * @param  Ypos: Y position
      * @retval RGB pixel color
      */
    uint32_t BSP_LCD_ReadPixel(uint16_t Xpos, uint16_t Ypos)
    {
        uint32_t ret = 0;

        if (hltdc_discovery.LayerCfg[ActiveLayer].PixelFormat == LTDC_PIXEL_FORMAT_ARGB8888)
        {
            /* Read data value from SDRAM memory */
            ret = *(__IO uint32_t*) (hltdc_discovery.LayerCfg[ActiveLayer].FBStartAdress + (4 * (Ypos*BSP_LCD_GetXSize() + Xpos)));
        }
        else if (hltdc_discovery.LayerCfg[ActiveLayer].PixelFormat == LTDC_PIXEL_FORMAT_RGB888)
        {
            /* Read data value from SDRAM memory */
            ret = (*(__IO uint32_t*) (hltdc_discovery.LayerCfg[ActiveLayer].FBStartAdress + (4 * (Ypos*BSP_LCD_GetXSize() + Xpos))) & 0x00FFFFFF);
        }
        else if ((hltdc_discovery.LayerCfg[ActiveLayer].PixelFormat == LTDC_PIXEL_FORMAT_RGB565) || \
            (hltdc_discovery.LayerCfg[ActiveLayer].PixelFormat == LTDC_PIXEL_FORMAT_ARGB4444) || \
            (hltdc_discovery.LayerCfg[ActiveLayer].PixelFormat == LTDC_PIXEL_FORMAT_AL88))
        {
            /* Read data value from SDRAM memory */
            ret = *(__IO uint16_t*) (hltdc_discovery.LayerCfg[ActiveLayer].FBStartAdress + (2 * (Ypos*BSP_LCD_GetXSize() + Xpos)));
        }
        else
        {
            /* Read data value from SDRAM memory */
            ret = *(__IO uint8_t*) (hltdc_discovery.LayerCfg[ActiveLayer].FBStartAdress + (2 * (Ypos*BSP_LCD_GetXSize() + Xpos)));
        }

        return ret;
    }

    /**
      * @brief  Clears the whole currently active layer of LTDC.
      * @param  Color: Color of the background
      */
    void BSP_LCD_Clear(uint32_t Color)
    {
        /* Clear the LCD */
        LL_FillBuffer(ActiveLayer, (uint32_t *)(hltdc_discovery.LayerCfg[ActiveLayer].FBStartAdress), BSP_LCD_GetXSize(), BSP_LCD_GetYSize(), 0, Color);
    }

    /**
      * @brief  Clears the selected line in currently active layer.
      * @param  Line: Line to be cleared
      */
    void BSP_LCD_ClearStringLine(uint32_t Line)
    {
        uint32_t color_backup = DrawProp[ActiveLayer].TextColor;
        DrawProp[ActiveLayer].TextColor = DrawProp[ActiveLayer].BackColor;

        /* Draw rectangle with background color */
        BSP_LCD_FillRect(0, (Line * DrawProp[ActiveLayer].pFont->Height), BSP_LCD_GetXSize(), DrawProp[ActiveLayer].pFont->Height);

        DrawProp[ActiveLayer].TextColor = color_backup;
        BSP_LCD_SetTextColor(DrawProp[ActiveLayer].TextColor);
    }

    /**
      * @brief  Displays one character in currently active layer.
      * @param  Xpos: Start column address
      * @param  Ypos: Line where to display the character shape.
      * @param  Ascii: Character ascii code
      *           This parameter must be a number between Min_Data = 0x20 and Max_Data = 0x7E
      */
    void BSP_LCD_DisplayChar(uint16_t Xpos, uint16_t Ypos, uint8_t Ascii)
    {
        DrawChar(Xpos, Ypos, &DrawProp[ActiveLayer].pFont->table[(Ascii - ' ') *\
            DrawProp[ActiveLayer].pFont->Height * ((DrawProp[ActiveLayer].pFont->Width + 7) / 8)]);
    }

    /**
      * @brief  Displays characters in currently active layer.
      * @param  Xpos: X position (in pixel)
      * @param  Ypos: Y position (in pixel)
      * @param  Text: Pointer to string to display on LCD
      * @param  Mode: Display mode
      *          This parameter can be one of the following values:
      *            @arg  CENTER_MODE
      *            @arg  RIGHT_MODE
      *            @arg  LEFT_MODE
      */
    void BSP_LCD_DisplayStringAt(uint16_t Xpos, uint16_t Ypos, uint8_t *Text, Text_AlignModeTypdef Mode)
    {
        uint16_t refcolumn = 1, i = 0;
        uint32_t size = 0, xsize = 0;
        uint8_t  *ptr = Text;

        /* Get the text size */
        while (*ptr++) size++;

