nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/UI/Displays/OTM8009A/OTM8009A_driver.cpp
        /* Characters number per line */
        xsize = (BSP_LCD_GetXSize() / DrawProp[ActiveLayer].pFont->Width);

        switch (Mode)
        {
        case CENTER_MODE:
        {
            refcolumn = Xpos + ((xsize - size)* DrawProp[ActiveLayer].pFont->Width) / 2;
            break;
        }
        case LEFT_MODE:
        {
            refcolumn = Xpos;
            break;
        }
        case RIGHT_MODE:
        {
            refcolumn = -Xpos + ((xsize - size)*DrawProp[ActiveLayer].pFont->Width);
            break;
        }
        default:
        {
            refcolumn = Xpos;
            break;
        }
        }

        /* Check that the Start column is located in the screen */
        if ((refcolumn < 1) || (refcolumn >= 0x8000))
        {
            refcolumn = 1;
        }

        /* Send the string character by character on LCD */
        while ((*Text != 0) & (((BSP_LCD_GetXSize() - (i*DrawProp[ActiveLayer].pFont->Width)) & 0xFFFF) >= DrawProp[ActiveLayer].pFont->Width))
        {
            /* Display one character on LCD */
            BSP_LCD_DisplayChar(refcolumn, Ypos, *Text);
            /* Decrement the column position by 16 */
            refcolumn += DrawProp[ActiveLayer].pFont->Width;

            /* Point on the next character */
            Text++;
            i++;
        }

    }

    /**
      * @brief  Displays a maximum of 60 characters on the LCD.
      * @param  Line: Line where to display the character shape
      * @param  ptr: Pointer to string to display on LCD
      */
    void BSP_LCD_DisplayStringAtLine(uint16_t Line, uint8_t *ptr)
    {
        BSP_LCD_DisplayStringAt(0, LINE(Line), ptr, LEFT_MODE);
    }

    /**
      * @brief  Draws an horizontal line in currently active layer.
      * @param  Xpos: X position
      * @param  Ypos: Y position
      * @param  Length: Line length
      */
    void BSP_LCD_DrawHLine(uint16_t Xpos, uint16_t Ypos, uint16_t Length)
    {
        uint32_t  Xaddress = 0;

        /* Get the line address */
        Xaddress = (hltdc_discovery.LayerCfg[ActiveLayer].FBStartAdress) + 4 * (BSP_LCD_GetXSize()*Ypos + Xpos);

        /* Write line */
        LL_FillBuffer(ActiveLayer, (uint32_t *)Xaddress, Length, 1, 0, DrawProp[ActiveLayer].TextColor);
    }

    /**
      * @brief  Draws a vertical line in currently active layer.
      * @param  Xpos: X position
      * @param  Ypos: Y position
      * @param  Length: Line length
      */
    void BSP_LCD_DrawVLine(uint16_t Xpos, uint16_t Ypos, uint16_t Length)
    {
        uint32_t  Xaddress = 0;

        /* Get the line address */
        Xaddress = (hltdc_discovery.LayerCfg[ActiveLayer].FBStartAdress) + 4 * (BSP_LCD_GetXSize()*Ypos + Xpos);

        /* Write line */
        LL_FillBuffer(ActiveLayer, (uint32_t *)Xaddress, 1, Length, (BSP_LCD_GetXSize() - 1), DrawProp[ActiveLayer].TextColor);
    }

    /**
      * @brief  Draws an uni-line (between two points) in currently active layer.
      * @param  x1: Point 1 X position
      * @param  y1: Point 1 Y position
      * @param  x2: Point 2 X position
      * @param  y2: Point 2 Y position
      */
    void BSP_LCD_DrawLine(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2)
    {
        int16_t deltax = 0, deltay = 0, x = 0, y = 0, xinc1 = 0, xinc2 = 0,
            yinc1 = 0, yinc2 = 0, den = 0, num = 0, numadd = 0, numpixels = 0,
            curpixel = 0;

        deltax = ABS(x2 - x1);        /* The difference between the x's */
        deltay = ABS(y2 - y1);        /* The difference between the y's */
        x = x1;                       /* Start x off at the first pixel */
        y = y1;                       /* Start y off at the first pixel */

        if (x2 >= x1)                 /* The x-values are increasing */
        {
            xinc1 = 1;
            xinc2 = 1;
        }
        else                          /* The x-values are decreasing */
        {
            xinc1 = -1;
            xinc2 = -1;
        }

        if (y2 >= y1)                 /* The y-values are increasing */
        {
            yinc1 = 1;
            yinc2 = 1;
        }
        else                          /* The y-values are decreasing */
        {
            yinc1 = -1;
            yinc2 = -1;
        }

        if (deltax >= deltay)         /* There is at least one x-value for every y-value */
        {
            xinc1 = 0;                  /* Don't change the x when numerator >= denominator */
            yinc2 = 0;                  /* Don't change the y for every iteration */
            den = deltax;
            num = deltax / 2;
            numadd = deltay;
            numpixels = deltax;         /* There are more x-values than y-values */
        }
        else                          /* There is at least one y-value for every x-value */
        {
            xinc2 = 0;                  /* Don't change the x for every iteration */
            yinc1 = 0;                  /* Don't change the y when numerator >= denominator */
            den = deltay;
            num = deltay / 2;
            numadd = deltax;
            numpixels = deltay;         /* There are more y-values than x-values */
        }

        for (curpixel = 0; curpixel <= numpixels; curpixel++)
        {
            BSP_LCD_DrawPixel(x, y, DrawProp[ActiveLayer].TextColor);   /* Draw the current pixel */
            num += numadd;                            /* Increase the numerator by the top of the fraction */
            if (num >= den)                           /* Check if numerator >= denominator */
            {
                num -= den;                             /* Calculate the new numerator value */
                x += xinc1;                             /* Change the x as appropriate */
                y += yinc1;                             /* Change the y as appropriate */
            }
            x += xinc2;                               /* Change the x as appropriate */
            y += yinc2;                               /* Change the y as appropriate */
        }
    }

    /**
      * @brief  Draws a rectangle in currently active layer.
      * @param  Xpos: X position
      * @param  Ypos: Y position
      * @param  Width: Rectangle width
      * @param  Height: Rectangle height
      */
    void BSP_LCD_DrawRect(uint16_t Xpos, uint16_t Ypos, uint16_t Width, uint16_t Height)
    {
        /* Draw horizontal lines */
        BSP_LCD_DrawHLine(Xpos, Ypos, Width);
        BSP_LCD_DrawHLine(Xpos, (Ypos + Height), Width);

        /* Draw vertical lines */
        BSP_LCD_DrawVLine(Xpos, Ypos, Height);
        BSP_LCD_DrawVLine((Xpos + Width), Ypos, Height);
    }

    /**
      * @brief  Draws a circle in currently active layer.
      * @param  Xpos: X position
      * @param  Ypos: Y position
      * @param  Radius: Circle radius
      */
    void BSP_LCD_DrawCircle(uint16_t Xpos, uint16_t Ypos, uint16_t Radius)
    {
        int32_t   D;    /* Decision Variable */
        uint32_t  CurX; /* Current X Value */
        uint32_t  CurY; /* Current Y Value */

        D = 3 - (Radius << 1);
        CurX = 0;
        CurY = Radius;

        while (CurX <= CurY)
        {
            BSP_LCD_DrawPixel((Xpos + CurX), (Ypos - CurY), DrawProp[ActiveLayer].TextColor);

            BSP_LCD_DrawPixel((Xpos - CurX), (Ypos - CurY), DrawProp[ActiveLayer].TextColor);

            BSP_LCD_DrawPixel((Xpos + CurY), (Ypos - CurX), DrawProp[ActiveLayer].TextColor);

            BSP_LCD_DrawPixel((Xpos - CurY), (Ypos - CurX), DrawProp[ActiveLayer].TextColor);

            BSP_LCD_DrawPixel((Xpos + CurX), (Ypos + CurY), DrawProp[ActiveLayer].TextColor);

            BSP_LCD_DrawPixel((Xpos - CurX), (Ypos + CurY), DrawProp[ActiveLayer].TextColor);

            BSP_LCD_DrawPixel((Xpos + CurY), (Ypos + CurX), DrawProp[ActiveLayer].TextColor);

            BSP_LCD_DrawPixel((Xpos - CurY), (Ypos + CurX), DrawProp[ActiveLayer].TextColor);

            if (D < 0)
            {
                D += (CurX << 2) + 6;
            }
            else
            {
                D += ((CurX - CurY) << 2) + 10;
                CurY--;
            }
            CurX++;
        }
    }


    /**
      * @brief  Draws a bitmap picture loaded in the internal Flash (32 bpp) in currently active layer.
      * @param  Xpos: Bmp X position in the LCD
      * @param  Ypos: Bmp Y position in the LCD
      * @param  pbmp: Pointer to Bmp picture address in the internal Flash
      */
    void BSP_LCD_DrawBitmap(uint32_t Xpos, uint32_t Ypos, uint8_t *pbmp)
    {
        uint32_t index = 0, width = 0, height = 0, bit_pixel = 0;
        uint32_t Address;
        uint32_t InputColorMode = 0;

        /* Get bitmap data address offset */
        index = *(__IO uint16_t *) (pbmp + 10);
        index |= (*(__IO uint16_t *) (pbmp + 12)) << 16;

        /* Read bitmap width */
        width = *(uint16_t *)(pbmp + 18);
        width |= (*(uint16_t *)(pbmp + 20)) << 16;

        /* Read bitmap height */
        height = *(uint16_t *)(pbmp + 22);
        height |= (*(uint16_t *)(pbmp + 24)) << 16;

        /* Read bit/pixel */
        bit_pixel = *(uint16_t *)(pbmp + 28);

        /* Set the address */
        Address = hltdc_discovery.LayerCfg[ActiveLayer].FBStartAdress + (((BSP_LCD_GetXSize()*Ypos) + Xpos)*(4));

