nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/UI/Displays/OTM8009A/OTM8009A_driver.cpp
        /* Get the layer pixel format */
        if ((bit_pixel / 8) == 4)
        {
            InputColorMode = DMA2D_INPUT_ARGB8888;
        }
        else if ((bit_pixel / 8) == 2)
        {
            InputColorMode = DMA2D_INPUT_RGB565;
        }
        else
        {
            InputColorMode = DMA2D_INPUT_RGB888;
        }

        /* Bypass the bitmap header */
        pbmp += (index + (width * (height - 1) * (bit_pixel / 8)));

        /* Convert picture to ARGB8888 pixel format */
        for (index = 0; index < height; index++)
        {
            /* Pixel format conversion */
            LL_ConvertLineToARGB8888((uint32_t *)pbmp, (uint32_t *)Address, width, InputColorMode);

            /* Increment the source and destination buffers */
            Address += (BSP_LCD_GetXSize() * 4);
            pbmp -= width * (bit_pixel / 8);
        }
    }

    /**
      * @brief  Switch back on the display if was switched off by previous call of BSP_LCD_DisplayOff().
      *         Exit DSI ULPM mode if was allowed and configured in Dsi Configuration.
      */
    void BSP_LCD_DisplayOn(void)
    {
        HAL_DSI_ShortWrite(&(hdsi_discovery), hdsivideo_handle.VirtualChannelID, DSI_DCS_SHORT_PKT_WRITE_P1, OTM8009A_CMD_DISPON, 0x00);
    }

    /**
      * @brief  Switch Off the display.
      *         Enter DSI ULPM mode if was allowed and configured in Dsi Configuration.
      */
    void BSP_LCD_DisplayOff(void)
    {
        HAL_DSI_ShortWrite(&(hdsi_discovery), hdsivideo_handle.VirtualChannelID, DSI_DCS_SHORT_PKT_WRITE_P1, OTM8009A_CMD_DISPOFF, 0x00);
    }

    /**
      * @brief  Set the brightness value
      * @param  BrightnessValue: [00: Min (black), 100 Max]
      */
    void BSP_LCD_SetBrightness(uint8_t BrightnessValue)
    {
        HAL_DSI_ShortWrite(&hdsi_discovery, LCD_OTM8009A_ID, DSI_DCS_SHORT_PKT_WRITE_P1, OTM8009A_CMD_WRDISBV, (uint16_t)(BrightnessValue * 255) / 100);
    }

    /**
      * @brief  DCS or Generic short/long write command
      * @param  NbrParams: Number of parameters. It indicates the write command mode:
      *                 If inferior to 2, a long write command is performed else short.
      * @param  pParams: Pointer to parameter values table.
      * @retval HAL status
      */

      // Returns the ID of LCD DSI
    static uint16_t LCD_IO_GetID(void)
    {
        return LCD_DSI_ID;
    }

    // LTDC, DMA2D and DSI BSP Routines, De-Initializes the BSP LCD Msp
    void BSP_LCD_MspDeInit(void)
    {
        HAL_NVIC_DisableIRQ(LTDC_IRQn);             // Disable IRQ of LTDC IP */
        HAL_NVIC_DisableIRQ(DMA2D_IRQn);            // Disable IRQ of DMA2D IP */
        HAL_NVIC_DisableIRQ(DSI_IRQn);               // Disable IRQ of DSI IP */
        __HAL_RCC_LTDC_FORCE_RESET();               // Force and let in reset state LTDC, DMA2D and DSI Host + Wrapper IPs */
        __HAL_RCC_DMA2D_FORCE_RESET();
        __HAL_RCC_DSI_FORCE_RESET();
        __HAL_RCC_LTDC_CLK_DISABLE();               // Disable the LTDC, DMA2D and DSI Host and Wrapper clocks */
        __HAL_RCC_DMA2D_CLK_DISABLE();
        __HAL_RCC_DSI_CLK_DISABLE();
    }

    // Initialize the BSP LCD Msp.
    void BSP_LCD_MspInit(void)
    {
        __HAL_RCC_LTDC_CLK_ENABLE();            // Enable the LTDC clock */
        __HAL_RCC_LTDC_FORCE_RESET();           // Toggle Sw reset of LTDC IP */
        __HAL_RCC_LTDC_RELEASE_RESET();
        __HAL_RCC_DMA2D_CLK_ENABLE();           // Enable the DMA2D clock */
        __HAL_RCC_DMA2D_FORCE_RESET();          // Toggle Sw reset of DMA2D IP */
        __HAL_RCC_DMA2D_RELEASE_RESET();
        __HAL_RCC_DSI_CLK_ENABLE();             // Enable DSI Host and wrapper clocks */
        __HAL_RCC_DSI_FORCE_RESET();            // Soft Reset the DSI Host and wrapper */
        __HAL_RCC_DSI_RELEASE_RESET();
        HAL_NVIC_SetPriority(LTDC_IRQn, 3, 0);  // NVIC configuration for LTDC interrupt that is now enabled */
        HAL_NVIC_EnableIRQ(LTDC_IRQn);
        HAL_NVIC_SetPriority(DMA2D_IRQn, 3, 0); // NVIC configuration for DMA2D interrupt that is now enabled */
        HAL_NVIC_EnableIRQ(DMA2D_IRQn);
        HAL_NVIC_SetPriority(DSI_IRQn, 3, 0);   // NVIC configuration for DSI interrupt that is now enabled */
        HAL_NVIC_EnableIRQ(DSI_IRQn);
    }

    // Draws a pixel on LCD ,Pixel color in ARGB mode (8-8-8-8)
    */
    void BSP_LCD_DrawPixel(uint16_t Xpos, uint16_t Ypos, uint32_t RGB_Code)
    {
        // Write data value to all SDRAM memory
        *(__IO uint32_t*) (hltdc_discovery.LayerCfg[ActiveLayer].FBStartAdress + (4 * (Ypos*BSP_LCD_GetXSize() + Xpos))) = RGB_Code;
    }


    /**
      * @brief  Fills a buffer.
      * @param  LayerIndex: Layer index
      * @param  pDst: Pointer to destination buffer
      * @param  xSize: Buffer width
      * @param  ySize: Buffer height
      * @param  OffLine: Offset
      * @param  ColorIndex: Color index
      */
    static void LL_FillBuffer(uint32_t LayerIndex, void *pDst, uint32_t xSize, uint32_t ySize, uint32_t OffLine, uint32_t ColorIndex)
    {
        /* Register to memory mode with ARGB8888 as color Mode */
        hdma2d_discovery.Init.Mode = DMA2D_R2M;
        hdma2d_discovery.Init.ColorMode = DMA2D_OUTPUT_ARGB8888;
        hdma2d_discovery.Init.OutputOffset = OffLine;

        hdma2d_discovery.Instance = DMA2D;

        /* DMA2D Initialization */
        if (HAL_DMA2D_Init(&hdma2d_discovery) == HAL_OK)
        {
            if (HAL_DMA2D_ConfigLayer(&hdma2d_discovery, LayerIndex) == HAL_OK)
            {
                if (HAL_DMA2D_Start(&hdma2d_discovery, ColorIndex, (uint32_t)pDst, xSize, ySize) == HAL_OK)
                {
                    /* Polling For DMA transfer */
                    HAL_DMA2D_PollForTransfer(&hdma2d_discovery, 10);
                }
            }
        }
    }

    /**
      * @brief  Converts a line to an ARGB8888 pixel format.
      * @param  pSrc: Pointer to source buffer
      * @param  pDst: Output color
      * @param  xSize: Buffer width
      * @param  ColorMode: Input color mode
      */
    static void LL_ConvertLineToARGB8888(void *pSrc, void *pDst, uint32_t xSize, uint32_t ColorMode)
    {
        /* Configure the DMA2D Mode, Color Mode and output offset */
        hdma2d_discovery.Init.Mode = DMA2D_M2M_PFC;
        hdma2d_discovery.Init.ColorMode = DMA2D_OUTPUT_ARGB8888;
        hdma2d_discovery.Init.OutputOffset = 0;

        /* Foreground Configuration */
        hdma2d_discovery.LayerCfg[1].AlphaMode = DMA2D_NO_MODIF_ALPHA;
        hdma2d_discovery.LayerCfg[1].InputAlpha = 0xFF;
        hdma2d_discovery.LayerCfg[1].InputColorMode = ColorMode;
        hdma2d_discovery.LayerCfg[1].InputOffset = 0;

        hdma2d_discovery.Instance = DMA2D;

        /* DMA2D Initialization */
        if (HAL_DMA2D_Init(&hdma2d_discovery) == HAL_OK)
        {
            if (HAL_DMA2D_ConfigLayer(&hdma2d_discovery, 1) == HAL_OK)
            {
                if (HAL_DMA2D_Start(&hdma2d_discovery, (uint32_t)pSrc, (uint32_t)pDst, xSize, 1) == HAL_OK)
                {
                    /* Polling For DMA transfer */
                    HAL_DMA2D_PollForTransfer(&hdma2d_discovery, 10);
                }
            }
        }
}
#pragma endregion
#pragma pop